<a href="https://colab.research.google.com/github/Priti1694/CodingWomen/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
s1=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
s1=pd.Series([1,2,3,4,5], index=['let me think','b','c','d','e'])
s1

let me think    1
b               2
c               3
d               4
e               5
dtype: int64

In [ ]:
s2=pd.Series({'a':23,'b':34,'c':21})
s2

In [9]:
s2=pd.Series({'a':23,'b':34,'c':21},index=['b','a','c','d'])
s2

b    34.0
a    23.0
c    21.0
d     NaN
dtype: float64

In [10]:
s1=pd.Series([1,2,3,4,5])
s1[3]

4

Pandas DataFrame

In [34]:
s1=pd.DataFrame({'NAME':['BOB','Tripa','Anaya'], 'AGE':[21,22,45], 'Roll_No':[3,4,5], 'MARKS':[70,54,62]})
s1.head()
s1.tail(2)
s1.shape
s1.describe()

(3, 4)

NameError: ignored

In [21]:
s1.iloc[0:2,0:3]

    NAME  AGE  Roll_No
0    BOB   21        3
1  Tripa   22        4

In [27]:
s1.loc[1:3,('Roll_No','MARKS')]

   Roll_No  MARKS
1        4     54
2        5     62

In [28]:
s1.drop('AGE',axis=1)

    NAME  Roll_No  MARKS
0    BOB        3     70
1  Tripa        4     54
2  Anaya        5     62

PANDAS Functions

In [32]:
def half(s):
    return s*0.5

In [33]:
s1[['MARKS']].apply(half)

   MARKS
0   35.0
1   27.0
2   31.0